*** TODO Part 2
 I am not find a clear way to represent the recursive enclosure of the bags. Recursive ~Dict~'s look bad.

I am trying a ASP solution to this problem. First part works perfectly and the examples are working for the second part but my answer is wrong for the actual problem. I don't understand why? First generate the input as prolog rules after loading [[src/day7.jl]] as follows :
#+begin_src
  write_rules_prolog("inputs/day7", "day7facts.prolog") # rewrite input as facts 
#+end_src

Aggregates are computing from a set. So multiple elements are counted once and this gave me the wrong answer. If I generate tuples and then do aggregation then we have a correct answer
#+begin_src sh :exports both :session *day7* :results output verbatim
  clingo -V0 day7facts.prolog src/day7.lp 
#+end_src

#+RESULTS:
: bagsInShiny(20189) shinyInBags(128)
: SATISFIABLE

The *almost* same prolog code gives me the correct solution
#+begin_src prolog :exports both
  :- consult("src/day7sol.prolog").
  :- consult("day7facts.prolog").
  :- all_bags_in(shiny_gold, N), print(N), nl.
#+end_src

#+RESULTS:
: 20189

** Day9
   #+begin_src ess-julia :exports both
     include(expanduser("~/projects/aoc20/src/day9.jl"))
     checknums(getnums("inputs/day9"), 25) # part1 
     find_cont_sum(22477624, getnums("inputs/day9")) # part 2
   #+end_src

   #+RESULTS:
   : 2980044

